backend/app/jobs/process_upload_job.rb

SELECT "uploads".* FROM "uploads" WHERE "uploads"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def perform(upload_id)
    upload = Upload.find(upload_id)