backend/app/services/process_cnab_service.rb

  def self.call(upload)
    upload.file.blob.open do |file|
      file.each do |line|
        transaction_type = Transaction::TRANSACTION_TYPE_MAP[line[0..0].to_i]
        date = line[1..8]
        amount = line[9..18]
        cpf = line[19..29]
        card_number = line[30..41]
        hour = line[42..47]
        company_name = line[48..61].strip
        shop_name = line[62..81].strip

        company = Company.find_or_create_by!(name: company_name)
        shop = Shop.find_or_create_by!(name: shop_name, company: company)

        Transaction.create!(
          transaction_type: transaction_type,
          date: Date.strptime(date, '%Y%m%d'),
          amount: amount.to_f / 100,
          cpf: cpf,
          card_number: card_number,
          hour: hour,
          company: company,
          shop: shop
        )
---
INSERT INTO "companies" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "JO\xC3\x83O MACEDO"], ["created_at", "2023-05-24 17:11:56.968713"], ["updated_at", "2023-05-24 17:11:56.968713"]]
SELECT "companies".* FROM "companies" WHERE "companies"."name" = $1 LIMIT $2  [["name", "JO\xC3\x83O MACEDO"], ["LIMIT", 1]]
INSERT INTO "companies" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", ""], ["created_at", "2023-05-24 16:58:57.932250"], ["updated_at", "2023-05-24 16:58:57.932250"]]
INSERT INTO "shops" ("name", "created_at", "updated_at", "company_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "BAR DO JO\xC3\x83O"], ["created_at", "2023-05-24 17:11:56.987450"], ["updated_at", "2023-05-24 17:11:56.987450"], ["company_id", 2]]
SELECT "shops".* FROM "shops" WHERE "shops"."name" = $1 AND "shops"."company_id" = $2 LIMIT $3  [["name", "BAR DO JO\xC3\x83O"], ["company_id", 2], ["LIMIT", 1]]
INSERT INTO "shops" ("name", "created_at", "updated_at", "company_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "BAR DO JO\xC3\x83O"], ["created_at", "2023-05-24 17:10:26.488149"], ["updated_at", "2023-05-24 17:10:26.488149"], ["company_id", 1]]
INSERT INTO "transactions" ("transaction_type", "date", "amount", "cpf", "created_at", "updated_at", "card_number", "hour", "company_id", "shop_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"