backend/app/controllers/transactions_controller.rb

  def index
    shops = Shop.includes(:transactions, :company).all
    shops_with_balance = shops.map do |shop|
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" IN ($1, $2, $3, $4)  [["id", 3], ["id", 4], ["id", 5], ["id", 6]]
SELECT "shops".* FROM "shops"
SELECT "transactions".* FROM "transactions" WHERE "transactions"."shop_id" IN ($1, $2, $3, $4, $5)  [["shop_id", 3], ["shop_id", 4], ["shop_id", 5], ["shop_id", 6], ["shop_id", 7]]