backend/app/controllers/uploads_controller.rb

  def create
    @upload = Upload.new(upload_params)

    if @upload.save
---
INSERT INTO "uploads" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2023-05-24 16:58:56.623866"], ["updated_at", "2023-05-24 16:58:56.623866"]]